qmk-arterytek/ChibiOS-Contrib/os/hal/ports/AT32/AT32F405/hal_lld.h
/*
    ChibiOS - Copyright (C) 2006..2018 Giovanni Di Sirio
    ChibiOS - Copyright (C) 2023..2024 HorrorTroll
    ChibiOS - Copyright (C) 2023..2024 Zhaqian

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    AT32F405/hal_lld.h
 * @brief   AT32F405 HAL subsystem low level driver header.
 * @pre     This module requires the following macros to be defined in the
 *          @p board.h file:
 *          - AT32_LEXTCLK.
 *          - AT32_LEXT_BYPASS (optionally).
 *          - AT32_HEXTCLK.
 *          - AT32_HEXT_BYPASS (optionally).
 *          .
 *          One of the following macros must also be defined:
 *          - AT32F405KB for K Mainstream Medium Density devices.
 *          - AT32F405CB for C Mainstream Medium Density devices.
 *          - AT32F405RB for R Mainstream Medium Density devices.
 *          - AT32F405KC for K Mainstream High Density devices.
 *          - AT32F405CC for C Mainstream High Density devices.
 *          - AT32F405RC for R Mainstream High Density devices.
 *          .
 *
 * @addtogroup HAL
 * @{
 */

#ifndef _HAL_LLD_H_
#define _HAL_LLD_H_

#include "at32_registry.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @brief   Requires use of SPIv2 driver model.
 */
#define HAL_LLD_SELECT_SPI_V2       TRUE

/**
 * @name    Platform identification
 * @{
 */
#if defined(__DOXYGEN__)
#define PLATFORM_NAME               "AT32F405"

#elif defined(AT32F405K_MD)
#define PLATFORM_NAME               "AT32F405K Mainstream Line Medium Density"

#elif defined(AT32F405K_HD)
#define PLATFORM_NAME               "AT32F405K Mainstream Line High Density"

#elif defined(AT32F405C_MD)
#define PLATFORM_NAME               "AT32F405C Mainstream Line Medium Density"

#elif defined(AT32F405C_HD)
#define PLATFORM_NAME               "AT32F405C Mainstream Line High Density"

#elif defined(AT32F405R_MD)
#define PLATFORM_NAME               "AT32F405R Mainstream Line Medium Density"

#elif defined(AT32F405R_HD)
#define PLATFORM_NAME               "AT32F405R Mainstream Line High Density"

#else
#error "unsupported or unrecognized AT32F405 member"
#endif

/**
 * @brief   Sub-family identifier.
 */
#if !defined(AT32F405) || defined(__DOXYGEN__)
#define AT32F405
#endif
/** @} */

/**
 * @name    Absolute Maximum Ratings
 * @{
 */

/**
 * @brief   Maximum system clock frequency.
 */
#define AT32_SYSCLK_MAX             216000000

/**
 * @brief   Maximum HEXT clock frequency.
 */
#define AT32_HEXTCLK_MAX            25000000

/**
 * @brief   Minimum HEXT clock frequency.
 */
#define AT32_HEXTCLK_MIN            4000000

/**
 * @brief   Maximum LEXT clock frequency.
 */
#define AT32_LEXTCLK_MAX            32768

/**
 * @brief   Minimum LEXT clock frequency.
 */
#define AT32_LEXTCLK_MIN            32768

/**
 * @brief   Maximum PLLs input clock frequency.
 */
#define AT32_PLLIN_MAX              16000000

/**
 * @brief   Minimum PLLs input clock frequency.
 */
#define AT32_PLLIN_MIN              2000000

/**
 * @brief   Maximum PLL output clock frequency.
 */
#define AT32_PLLOUT_MAX             216000000

/**
 * @brief   Minimum PLL output clock frequency.
 */
#define AT32_PLLOUT_MIN             4000000

/**
 * @brief   Maximum PLL VCO clock frequency.
 */
#define AT32_PLLVCO_MAX             1000000000

/**
 * @brief   Minimum PLL VCO clock frequency.
 */
#define AT32_PLLVCO_MIN             500000000

/**
 * @brief   Maximum APB1 clock frequency.
 */
#define AT32_PCLK1_MAX              120000000

/**
 * @brief   Maximum APB2 clock frequency.
 */
#define AT32_PCLK2_MAX              216000000
/** @} */

/**
 * @name    Internal clock sources
 * @{
 */
#define AT32_HICKCLK                48000000             /**< High speed internal clock.         */
#define AT32_LICKCLK                40000                /**< Low speed internal clock.          */
/** @} */

/**
 * @name    PWC_CTRL register bits definitions
 * @{
 */
#define AT32_PVMSEL_MASK            (7 << 5)             /**< PVMSEL bits mask.                  */
#define AT32_PVMSEL_LEV1            (1 << 5)             /**< PVM level 1.                       */
#define AT32_PVMSEL_LEV2            (2 << 5)             /**< PVM level 2.                       */
#define AT32_PVMSEL_LEV3            (3 << 5)             /**< PVM level 3.                       */
#define AT32_PVMSEL_LEV4            (4 << 5)             /**< PVM level 4.                       */
#define AT32_PVMSEL_LEV5            (5 << 5)             /**< PVM level 5.                       */
#define AT32_PVMSEL_LEV6            (6 << 5)             /**< PVM level 6.                       */
#define AT32_PVMSEL_LEV7            (7 << 5)             /**< PVM level 7.                       */
/** @} */

/**
 * @name    PWC_LDOOV register bits definitions
 * @{
 */
#define AT32_LDOOVSEL_LEV0          (0 << 0)             /**< LDOOVSEL level 0.                  */
#define AT32_LDOOVSEL_LEV2          (2 << 0)             /**< LDOOVSEL level 2.                  */
#define AT32_LDOOVSEL_LEV3          (3 << 0)             /**< LDOOVSEL level 3.                  */
/** @} */

/**
 * @name    CRM_PLLCFG register bits definitions
 * @{
 */
#define AT32_PLL_FP_DIV1            (0 << 16)            /**< PLL clock divided by 1.            */
#define AT32_PLL_FP_DIV2            (1 << 16)            /**< PLL clock divided by 2.            */
#define AT32_PLL_FP_DIV4            (2 << 16)            /**< PLL clock divided by 4.            */
#define AT32_PLL_FP_DIV6            (3 << 16)            /**< PLL clock divided by 6.            */
#define AT32_PLL_FP_DIV8            (4 << 16)            /**< PLL clock divided by 8.            */
#define AT32_PLL_FP_DIV10           (5 << 16)            /**< PLL clock divided by 10.           */
#define AT32_PLL_FP_DIV12           (6 << 16)            /**< PLL clock divided by 12.           */
#define AT32_PLL_FP_DIV14           (7 << 16)            /**< PLL clock divided by 14.           */
#define AT32_PLL_FP_DIV16           (8 << 16)            /**< PLL clock divided by 16.           */
#define AT32_PLL_FP_DIV18           (9 << 16)            /**< PLL clock divided by 18.           */
#define AT32_PLL_FP_DIV20           (10 << 16)           /**< PLL clock divided by 20.           */
#define AT32_PLL_FP_DIV22           (11 << 16)           /**< PLL clock divided by 22.           */
#define AT32_PLL_FP_DIV24           (12 << 16)           /**< PLL clock divided by 24.           */
#define AT32_PLL_FP_DIV26           (13 << 16)           /**< PLL clock divided by 26.           */
#define AT32_PLL_FP_DIV28           (14 << 16)           /**< PLL clock divided by 28.           */
#define AT32_PLL_FP_DIV30           (15 << 16)           /**< PLL clock divided by 30.           */

