qmk-arterytek/ChibiOS-Contrib/os/hal/ports/AT32/AT32F405/hal_lld.h
#define AT32_PLL_FU_DIV11           (0 << 20)            /**< PLLU clock divided by 11.          */
#define AT32_PLL_FU_DIV13           (1 << 20)            /**< PLLU clock divided by 13.          */
#define AT32_PLL_FU_DIV12           (2 << 20)            /**< PLLU clock divided by 12.          */
#define AT32_PLL_FU_DIV14           (3 << 20)            /**< PLLU clock divided by 14.          */
#define AT32_PLL_FU_DIV16           (4 << 20)            /**< PLLU clock divided by 16.          */
#define AT32_PLL_FU_DIV18           (5 << 20)            /**< PLLU clock divided by 18.          */
#define AT32_PLL_FU_DIV20           (6 << 20)            /**< PLLU clock divided by 20.          */

#define AT32_PLLRCS_HICK            (0 << 30)            /**< PLL clock source is HICK.          */
#define AT32_PLLRCS_HEXT            (1 << 30)            /**< PLL clock source is HEXT.          */
/** @} */

/**
 * @name    CRM_CFG register bits definitions
 * @{
 */
#define AT32_SCLKSEL_HICK           (0 << 0)             /**< SCLK source is HICK.               */
#define AT32_SCLKSEL_HEXT           (1 << 0)             /**< SCLK source is HEXT.               */
#define AT32_SCLKSEL_PLL            (2 << 0)             /**< SCLK source is PLL.                */

#define AT32_SCLKSTS_HICK           (0 << 2)             /**< SCLK use HICK.                     */
#define AT32_SCLKSTS_HEXT           (1 << 2)             /**< SCLK use HEXT.                     */
#define AT32_SCLKSTS_PLL            (2 << 2)             /**< SCLK use PLL.                      */

#define AT32_AHBDIV_DIV1            (0 << 4)             /**< SCLK divided by 1.                 */
#define AT32_AHBDIV_DIV2            (8 << 4)             /**< SCLK divided by 2.                 */
#define AT32_AHBDIV_DIV4            (9 << 4)             /**< SCLK divided by 4.                 */
#define AT32_AHBDIV_DIV8            (10 << 4)            /**< SCLK divided by 8.                 */
#define AT32_AHBDIV_DIV16           (11 << 4)            /**< SCLK divided by 16.                */
#define AT32_AHBDIV_DIV64           (12 << 4)            /**< SCLK divided by 64.                */
#define AT32_AHBDIV_DIV128          (13 << 4)            /**< SCLK divided by 128.               */
#define AT32_AHBDIV_DIV256          (14 << 4)            /**< SCLK divided by 256.               */
#define AT32_AHBDIV_DIV512          (15 << 4)            /**< SCLK divided by 512.               */

#define AT32_APB1DIV_DIV1           (0 << 10)            /**< HCLK divided by 1.                 */
#define AT32_APB1DIV_DIV2           (4 << 10)            /**< HCLK divided by 2.                 */
#define AT32_APB1DIV_DIV4           (5 << 10)            /**< HCLK divided by 4.                 */
#define AT32_APB1DIV_DIV8           (6 << 10)            /**< HCLK divided by 8.                 */
#define AT32_APB1DIV_DIV16          (7 << 10)            /**< HCLK divided by 16.                */

#define AT32_APB2DIV_DIV1           (0 << 13)            /**< HCLK divided by 1.                 */
#define AT32_APB2DIV_DIV2           (4 << 13)            /**< HCLK divided by 2.                 */
#define AT32_APB2DIV_DIV4           (5 << 13)            /**< HCLK divided by 4.                 */
#define AT32_APB2DIV_DIV8           (6 << 13)            /**< HCLK divided by 8.                 */
#define AT32_APB2DIV_DIV16          (7 << 13)            /**< HCLK divided by 16.                */

#define AT32_I2SF5CLKSEL_SCLK       (0 << 22)            /**< I2SF5CLKSEL is SCLK.               */
#define AT32_I2SF5CLKSEL_PLL        (1 << 22)            /**< I2SF5CLKSEL is PLL.                */
#define AT32_I2SF5CLKSEL_HICK       (2 << 22)            /**< I2SF5CLKSEL is HICK.               */
#define AT32_I2SF5CLKSEL_EXTERNAL   (3 << 22)            /**< I2SF5CLKSEL is External input CLK. */

#define AT32_CLKOUTDIV1_DIV1        (0 << 27)            /**< CLKOUT1 divided by 1.              */
#define AT32_CLKOUTDIV1_DIV2        (4 << 27)            /**< CLKOUT1 divided by 2.              */
#define AT32_CLKOUTDIV1_DIV3        (5 << 27)            /**< CLKOUT1 divided by 3.              */
#define AT32_CLKOUTDIV1_DIV4        (6 << 27)            /**< CLKOUT1 divided by 4.              */
#define AT32_CLKOUTDIV1_DIV5        (7 << 27)            /**< CLKOUT1 divided by 5.              */

#define AT32_CLKOUT_SEL1_CFG_MASK   (3 << 30)            /**< CLKOUT_SEL1 pin on CRM_CFG mask.   */
#define AT32_CLKOUT_SEL1_SCLK       (0 << 30)            /**< SCLK on CLKOUT_SEL1 pin.           */
#define AT32_CLKOUT_SEL1_HEXT       (2 << 30)            /**< HEXT clock on CLKOUT_SEL1 pin.     */
#define AT32_CLKOUT_SEL1_PLL        (3 << 30)            /**< PLL clock on CLKOUT_SEL1 pin.      */
/** @} */

/**
 * @name    CRM_BPDC register bits definitions
 * @{
 */
#define AT32_ERTCSEL_MASK           (3 << 8)             /**< ERTC clock source mask.            */
#define AT32_ERTCSEL_NOCLOCK        (0 << 8)             /**< No clock.                          */
#define AT32_ERTCSEL_LEXT           (1 << 8)             /**< LEXT used as ERTC clock.           */
#define AT32_ERTCSEL_LICK           (2 << 8)             /**< LICK used as ERTC clock.           */
#define AT32_ERTCSEL_HEXTDIV        (3 << 8)             /**< HEXT divided used as ERTC clock.   */
/** @} */

/**
 * @name    CRM_MISC1 register bits definitions
 * @{
 */
#define AT32_HICKDIV_MASK           (1 << 12)            /**< HICKDIV mask.                      */
#define AT32_HICKDIV_DIV6           (0 << 12)            /**< HICK divided by 6.                 */
#define AT32_HICKDIV_DIV1           (1 << 12)            /**< HICK divided by 1.                 */

#define AT32_HICK_TO_SCLK_MASK      (1 << 14)            /**< HICK_TO_SCLK mask.                 */
#define AT32_HICK_TO_SCLK_8M        (0 << 14)            /**< SCLK is 8 MHz if SCLK is HICK.     */
#define AT32_HICK_TO_SCLK_48M       (1 << 14)            /**< SCLK is 48 MHz if SCLK is HICK.    */

#define AT32_CLKOUT_SEL2_MISC1_MASK (15 << 16)           /**< CLKOUT_SEL2 pin on CRM_MISC1 mask. */
#define AT32_CLKOUT_SEL2_USBFS      ((1 << 30) | (0 << 16))
                                                         /**< USBFS clock on CLKOUT_SEL2 pin.    */
#define AT32_CLKOUT_SEL2_ADC        ((1 << 30) | (1 << 16))
                                                         /**< ADC clock on CLKOUT_SEL2 pin.      */
#define AT32_CLKOUT_SEL2_HICK       ((1 << 30) | (2 << 16))
                                                         /**< HICK clock on CLKOUT_SEL2 pin.     */
#define AT32_CLKOUT_SEL2_LICK       ((1 << 30) | (3 << 16))
                                                         /**< LICK clock on CLKOUT_SEL2 pin.     */
#define AT32_CLKOUT_SEL2_LEXT       ((1 << 30) | (4 << 16))
                                                         /**< LEXT clock on CLKOUT_SEL2 pin.     */
#define AT32_CLKOUT_SEL2_USBHS      ((1 << 30) | (5 << 16))
                                                         /**< USBHS clock on CLKOUT_SEL2 pin.    */

#define AT32_CLKOUTDIV2_DIV1        (0 << 28)            /**< CLKOUT2 divided by 1.              */
#define AT32_CLKOUTDIV2_DIV2        (8 << 28)            /**< CLKOUT2 divided by 2.              */
#define AT32_CLKOUTDIV2_DIV4        (9 << 28)            /**< CLKOUT2 divided by 4.              */
#define AT32_CLKOUTDIV2_DIV8        (10 << 28)           /**< CLKOUT2 divided by 8.              */
#define AT32_CLKOUTDIV2_DIV16       (11 << 28)           /**< CLKOUT2 divided by 16.             */
#define AT32_CLKOUTDIV2_DIV64       (12 << 28)           /**< CLKOUT2 divided by 64.             */
#define AT32_CLKOUTDIV2_DIV128      (13 << 28)           /**< CLKOUT2 divided by 128.            */
#define AT32_CLKOUTDIV2_DIV256      (14 << 28)           /**< CLKOUT2 divided by 256.            */
#define AT32_CLKOUTDIV2_DIV512      (15 << 28)           /**< CLKOUT2 divided by 512.            */
/** @} */

/**
 * @name    CRM_MISC2 register bits definitions
 * @{
 */
#define AT32_PLLU_USB48_SEL_MASK    (1 << 10)            /**< PLLU_USB48_SEL mask.               */
#define AT32_PLLU_USB48_SEL_PLLU    (0 << 10)            /**< PLLU_USB48_SEL source is PLLU.     */
#define AT32_PLLU_USB48_SEL_HICK    (1 << 10)            /**< PLLU_USB48_SEL source is HICK.     */

#define AT32_HICK_TO_SCLK_DIV_MASK  (7 << 16)            /**< HICK_TO_SCLK divided mask.         */
#define AT32_HICK_TO_SCLK_DIV_DIV1  (0 << 16)            /**< HICK divided by 1.                 */
#define AT32_HICK_TO_SCLK_DIV_DIV2  (1 << 16)            /**< HICK divided by 2.                 */
#define AT32_HICK_TO_SCLK_DIV_DIV4  (2 << 16)            /**< HICK divided by 4.                 */
#define AT32_HICK_TO_SCLK_DIV_DIV8  (3 << 16)            /**< HICK divided by 8.                 */
#define AT32_HICK_TO_SCLK_DIV_DIV16 (4 << 16)            /**< HICK divided by 16.                */

#define AT32_HEXT_TO_SCLK_DIV_MASK  (7 << 19)            /**< HEXT_TO_SCLK divided mask.         */
#define AT32_HEXT_TO_SCLK_DIV_DIV1  (0 << 19)            /**< HEXT divided by 1.                 */
#define AT32_HEXT_TO_SCLK_DIV_DIV2  (1 << 19)            /**< HEXT divided by 2.                 */
#define AT32_HEXT_TO_SCLK_DIV_DIV4  (2 << 19)            /**< HEXT divided by 4.                 */
#define AT32_HEXT_TO_SCLK_DIV_DIV8  (3 << 19)            /**< HEXT divided by 8.                 */
#define AT32_HEXT_TO_SCLK_DIV_DIV16 (4 << 19)            /**< HEXT divided by 16.                */
#define AT32_HEXT_TO_SCLK_DIV_DIV32 (5 << 19)            /**< HEXT divided by 32.                */
/** @} */

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @name    Configuration options
 * @{
 */
/**
 * @brief   Disables the PWC/CRM initialization in the HAL.
 */
#if !defined(AT32_NO_INIT) || defined(__DOXYGEN__)
#define AT32_NO_INIT                FALSE
#endif

/**
 * @brief   Enables or disables the power voltage monitoring.
 */
#if !defined(AT32_PVM_ENABLE) || defined(__DOXYGEN__)
#define AT32_PVM_ENABLE             FALSE
#endif

/**
 * @brief   Sets voltage level for power voltage monitoring.
 */
#if !defined(AT32_PVMSEL) || defined(__DOXYGEN__)
#define AT32_PVMSEL                 AT32_PVMSEL_LEV1
#endif

/**
 * @brief   Sets voltage level for voltage regulator output.
 */
#if !defined(AT32_LDOOVSEL) || defined(__DOXYGEN__)
#define AT32_LDOOVSEL               AT32_LDOOVSEL_LEV3
#endif

/**
 * @brief   Enables or disables the HICK clock source.
 */
#if !defined(AT32_HICK_ENABLED) || defined(__DOXYGEN__)
#define AT32_HICK_ENABLED           TRUE
#endif

/**
 * @brief   Enables or disables the LICK clock source.
 */
#if !defined(AT32_LICK_ENABLED) || defined(__DOXYGEN__)
#define AT32_LICK_ENABLED           FALSE
#endif

/**
 * @brief   Enables or disables the HEXT clock source.
 */
#if !defined(AT32_HEXT_ENABLED) || defined(__DOXYGEN__)
#define AT32_HEXT_ENABLED           TRUE
#endif

/**
 * @brief   Enables or disables the LEXT clock source.
 */
#if !defined(AT32_LEXT_ENABLED) || defined(__DOXYGEN__)
#define AT32_LEXT_ENABLED           FALSE
#endif

/**
 * @brief   Enables or disables the PLLU clock source.
 */
#if !defined(AT32_PLLU_ENABLED) || defined(__DOXYGEN__)
#define AT32_PLLU_ENABLED           TRUE
#endif

/**
 * @brief   Main clock source selection.
 * @note    If the selected clock source is not the PLL then the PLL is not
 *          initialized and started.
 * @note    The default value is calculated for a 216MHz system clock from
 *          a 12MHz crystal using the PLL.
 */
#if !defined(AT32_SCLKSEL) || defined(__DOXYGEN__)
#define AT32_SCLKSEL                AT32_SCLKSEL_PLL
#endif

/**
 * @brief   Clock source for the PLL.
 * @note    This setting has only effect if the PLL is selected as the
 *          system clock source.
 * @note    The default value is calculated for a 216MHz system clock from
 *          a 12MHz crystal using the PLL.
 */
#if !defined(AT32_PLLRCS) || defined(__DOXYGEN__)
#define AT32_PLLRCS                 AT32_PLLRCS_HEXT
#endif

/**
 * @brief   PLL MS divider value.
 * @note    The allowed values are 1..15.
 * @note    The default value is calculated for a 216MHz system clock from
 *          a 12MHz crystal using the PLL.
 */
#if !defined(AT32_PLL_MS_VALUE) || defined(__DOXYGEN__)
#define AT32_PLL_MS_VALUE           1
#endif

/**
 * @brief   PLL NS multiplier value.
 * @note    The allowed values are 31..500.
 * @note    The default value is calculated for a 216MHz system clock from
 *          a 12MHz crystal using the PLL.
 */
#if !defined(AT32_PLL_NS_VALUE) || defined(__DOXYGEN__)
#define AT32_PLL_NS_VALUE           72
#endif

/**
 * @brief   PLL FP divider value.
 * @note    The allowed values are 1, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20,
 *          22, 24, 26, 28, 30.
 * @note    The default value is calculated for a 216MHz system clock from
 *          a 12MHz crystal using the PLL.
 */
#if !defined(AT32_PLL_FP_VALUE) || defined(__DOXYGEN__)
#define AT32_PLL_FP_VALUE           4
#endif

/**
 * @brief   PLL FU divider value.
 * @note    The allowed values are 11, 12, 13, 14, 16, 18, 20.
 * @note    The default value is calculated for a 216MHz system clock from
 *          a 12MHz crystal using the PLL.
 */
#if !defined(AT32_PLL_FU_VALUE) || defined(__DOXYGEN__)
#define AT32_PLL_FU_VALUE           18
#endif

/**
 * @brief   AHB prescaler value.
 * @note    The default value is calculated for a 216MHz system clock from
 *          a 12MHz crystal using the PLL.
 */
#if !defined(AT32_AHBDIV) || defined(__DOXYGEN__)
#define AT32_AHBDIV                 AT32_AHBDIV_DIV1
#endif

/**
 * @brief   APB1 prescaler value.
 */
#if !defined(AT32_APB1DIV) || defined(__DOXYGEN__)
#define AT32_APB1DIV                AT32_APB1DIV_DIV2
#endif

/**
 * @brief   APB2 prescaler value.
 */
#if !defined(AT32_APB2DIV) || defined(__DOXYGEN__)
#define AT32_APB2DIV                AT32_APB2DIV_DIV1
#endif

/**
 * @brief   HICK source selection if SCLK is HICK.
 */
#if !defined(AT32_HICK_TO_SCLK) || defined(__DOXYGEN__)
#define AT32_HICK_TO_SCLK           AT32_HICK_TO_SCLK_48M
#endif

/**
 * @brief   HICK prescaler selection.
 */
#if !defined(AT32_HICKDIV) || defined(__DOXYGEN__)
#define AT32_HICKDIV                AT32_HICKDIV_DIV1
#endif

/**
 * @brief   HICK prescaler value when SCLK is HICK.
 */
#if !defined(AT32_HICK_TO_SCLK_DIV) || defined(__DOXYGEN__)
#define AT32_HICK_TO_SCLK_DIV       AT32_HICK_TO_SCLK_DIV_DIV1
#endif

/**
 * @brief   HEXT prescaler value when SCLK is HEXT.
 */
#if !defined(AT32_HEXT_TO_SCLK_DIV) || defined(__DOXYGEN__)
#define AT32_HEXT_TO_SCLK_DIV       AT32_HEXT_TO_SCLK_DIV_DIV1
#endif

/**
 * @brief   USB clock setting.
 */
#if !defined(AT32_USB_CLOCK48_REQUIRED) || defined(__DOXYGEN__)
#define AT32_USB_CLOCK48_REQUIRED   TRUE
#endif

/**
 * @brief   USB clock source selection.
 */
#if !defined(AT32_PLLU_USB48_SEL) || defined(__DOXYGEN__)
#define AT32_PLLU_USB48_SEL         AT32_PLLU_USB48_SEL_PLLU
#endif

/**
 * @brief   CLKOUT_SEL1 pin setting.
 */
#if !defined(AT32_CLKOUT_SEL1) || defined(__DOXYGEN__)
#define AT32_CLKOUT_SEL1            AT32_CLKOUT_SEL1_SCLK
#endif

/**
 * @brief   CLKOUT_SEL1 prescaler value.
 */
#if !defined(AT32_CLKOUTDIV1) || defined(__DOXYGEN__)
#define AT32_CLKOUTDIV1             AT32_CLKOUTDIV1_DIV1
#endif

/**
 * @brief   CLKOUT_SEL2 pin setting.
 */
#if !defined(AT32_CLKOUT_SEL2) || defined(__DOXYGEN__)
#define AT32_CLKOUT_SEL2            AT32_CLKOUT_SEL2_HICK
#endif

/**
 * @brief   CLKOUT_SEL2 prescaler value.
 */
#if !defined(AT32_CLKOUTDIV2) || defined(__DOXYGEN__)
#define AT32_CLKOUTDIV2             AT32_CLKOUTDIV2_DIV1
#endif

/**
 * @brief   ERTC clock source.
 */
#if !defined(AT32_ERTCSEL) || defined(__DOXYGEN__)
#define AT32_ERTCSEL                AT32_ERTCSEL_NOCLOCK
#endif

/**
 * @brief   ERTC HEXT prescaler value.
 * @note    The allowed values are 2..31.
 */
#if !defined(AT32_ERTCDIV_VALUE) || defined(__DOXYGEN__)
#define AT32_ERTCDIV_VALUE          12
#endif

/**
 * @brief   I2SF5 clock source.
 */
#if !defined(AT32_I2SF5CLKSEL) || defined(__DOXYGEN__)
#define AT32_I2SF5CLKSEL            AT32_I2SF5CLKSEL_SCLK
#endif
/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

