qmk-arterytek/ChibiOS-Contrib/os/hal/ports/AT32/AT32F405/hal_lld.h
/*
 * Configuration-related checks.
 */
#if !defined(AT32F405_MCUCONF)
#error "Using a wrong mcuconf.h file, AT32F405_MCUCONF not defined"
#endif

/*
 * Board files sanity checks.
 */
#if !defined(AT32_LEXTCLK)
#error "AT32_LEXTCLK not defined in board.h"
#endif

#if !defined(AT32_HEXTCLK)
#error "AT32_HEXTCLK not defined in board.h"
#endif

/*
 * HICK related checks.
 */
#if AT32_HICK_ENABLED
#else /* !AT32_HICK_ENABLED */

#if AT32_SCLKSEL == AT32_SCLKSEL_HICK
#error "HICK not enabled, required by AT32_SCLKSEL"
#endif

#if ((AT32_SCLKSEL == AT32_SCLKSEL_HICK) && (AT32_PLLRCS == AT32_PLLRCS_HICK))
#error "HICK not enabled, required by AT32_SCLKSEL and AT32_PLLRCS"
#endif

#if (AT32_CLKOUT_SEL2 == AT32_CLKOUT_SEL2_HICK) ||                          \
    ((AT32_CLKOUT_SEL1 == AT32_CLKOUT_SEL1_PLL) &&                          \
     (AT32_PLLRCS == AT32_PLLRCS_HICK))
#error "HICK not enabled, required by AT32_CLKOUT_SEL1 or AT32_CLKOUT_SEL2"
#endif

#if (AT32_PLLU_USB48_SEL == AT32_PLLU_USB48_SEL_HICK) ||                    \
    ((AT32_PLLU_USB48_SEL == AT32_PLLU_USB48_SEL_PLLU) &&                   \
     (AT32_PLLRCS == AT32_PLLRCS_HICK))
#error "HICK not enabled, required by AT32_PLLU_USB48_SEL"
#endif

#if (AT32_I2SF5CLKSEL == AT32_I2SF5CLKSEL_HICK) ||                          \
    ((AT32_I2SF5CLKSEL == AT32_I2SF5CLKSEL_PLL) &&                          \
     (AT32_PLLRCS == AT32_PLLRCS_HICK)) ||                                  \
    ((AT32_I2SF5CLKSEL == AT32_I2SF5CLKSEL_SCLK) &&                         \
     (AT32_SCLKSEL == AT32_SCLKSEL_HICK)) ||                                \
    ((AT32_I2SF5CLKSEL == AT32_I2SF5CLKSEL_SCLK) &&                         \
     (AT32_SCLKSEL == AT32_SCLKSEL_PLL) &&                                  \
     (AT32_PLLRCS == AT32_PLLRCS_HICK))
#error "HICK not enabled, required by AT32_I2SF5CLKSEL"
#endif

#endif /* !AT32_HICK_ENABLED */

/*
 * HEXT related checks.
 */
#if AT32_HEXT_ENABLED

#if AT32_HEXTCLK == 0
#error "HEXT frequency not defined"
#elif (AT32_HEXTCLK < AT32_HEXTCLK_MIN) || (AT32_HEXTCLK > AT32_HEXTCLK_MAX)
#error "AT32_HEXTCLK outside acceptable range (AT32_HEXTCLK_MIN...AT32_HEXTCLK_MAX)"
#endif

#else /* !AT32_HEXT_ENABLED */

#if AT32_SCLKSEL == AT32_SCLKSEL_HEXT
#error "HEXT not enabled, required by AT32_SCLKSEL"
#endif

#if ((AT32_SCLKSEL == AT32_SCLKSEL_PLL) && (AT32_PLLRCS == AT32_PLLRCS_HEXT))
#error "HEXT not enabled, required by AT32_SCLKSEL and AT32_PLLRCS"
#endif

#if (AT32_CLKOUT_SEL1 == AT32_CLKOUT_SEL1_HEXT) ||                          \
    ((AT32_CLKOUT_SEL1 == AT32_CLKOUT_SEL1_PLL) &&                          \
     (AT32_PLLRCS == AT32_PLLRCS_HEXT))
#error "HEXT not enabled, required by AT32_CLKOUT_SEL1"
#endif

#if AT32_ERTCSEL == AT32_ERTCSEL_HEXTDIV
#error "HEXT not enabled, required by AT32_ERTCSEL"
#endif

#if ((AT32_I2SF5CLKSEL == AT32_I2SF5CLKSEL_PLL) &&                          \
     (AT32_PLLRCS == AT32_PLLRCS_HEXT)) ||                                  \
    ((AT32_I2SF5CLKSEL == AT32_I2SF5CLKSEL_SCLK) &&                         \
     (AT32_SCLKSEL == AT32_SCLKSEL_HEXT)) ||                                \
    ((AT32_I2SF5CLKSEL == AT32_I2SF5CLKSEL_SCLK) &&                         \
     (AT32_SCLKSEL == AT32_SCLKSEL_PLL) &&                                  \
     (AT32_PLLRCS == AT32_PLLRCS_HEXT))
#error "HEXT not enabled, required by AT32_I2SF5CLKSEL"
#endif

#endif /* !AT32_HEXT_ENABLED */

/*
 * LICK related checks.
 */
#if AT32_LICK_ENABLED
#else /* !AT32_LICK_ENABLED */

#if AT32_CLKOUT_SEL2 == AT32_CLKOUT_SEL2_LICK
#error "LICK not enabled, required by AT32_CLKOUT_SEL2"
#endif

#if HAL_USE_RTC && (AT32_ERTCSEL == AT32_ERTCSEL_LICK)
#error "LICK not enabled, required by AT32_ERTCSEL"
#endif
#endif /* !AT32_LICK_ENABLED */

/*
 * LEXT related checks.
 */
#if AT32_LEXT_ENABLED

#if (AT32_LEXTCLK == 0)
#error "LEXT frequency not defined"
#elif (AT32_LEXTCLK < AT32_LEXTCLK_MIN) || (AT32_LEXTCLK > AT32_LEXTCLK_MAX)
#error "AT32_LEXTCLK outside acceptable range (AT32_LEXTCLK_MIN...AT32_LEXTCLK_MAX)"
#endif

#else /* !AT32_LEXT_ENABLED */

#if AT32_CLKOUT_SEL2 == AT32_CLKOUT_SEL2_LEXT
#error "LEXT not enabled, required by AT32_CLKOUT_SEL2"
#endif

#if AT32_ERTCSEL == AT32_ERTCSEL_LEXT
#error "LEXT not enabled, required by AT32_ERTCSEL"
#endif

#endif /* !AT32_LEXT_ENABLED */

/*
 * PLLU related checks.
 */
#if AT32_PLLU_ENABLED
#else /* !AT32_PLLU_ENABLED */

#if AT32_PLLU_USB48_SEL == AT32_PLLU_USB48_SEL_PLLU
#error "PLLU not enabled, required by AT32_PLLU_USB48_SEL"
#endif
#endif /* !AT32_PLLU_ENABLED */

/*
 * PLL enable check.
 */
#if (AT32_USB_CLOCK48_REQUIRED &&                                           \
    (AT32_PLLU_USB48_SEL == AT32_PLLU_USB48_SEL_PLLU)) ||                   \
    (AT32_SCLKSEL == AT32_SCLKSEL_PLL) ||                                   \
    (AT32_I2SF5CLKSEL == AT32_I2SF5CLKSEL_PLL) ||                           \
    (AT32_CLKOUT_SEL1 == AT32_CLKOUT_SEL1_PLL) ||                           \
    (AT32_PLLU_ENABLED) || defined(__DOXYGEN__)

/**
 * @brief   PLL activation flag.
 */
#define AT32_ACTIVATE_PLL           TRUE
#else
#define AT32_ACTIVATE_PLL           FALSE
#endif

/**
 * @brief   PLL input clock frequency.
 */
#if (AT32_PLLRCS == AT32_PLLRCS_HEXT) || defined(__DOXYGEN__)
#define AT32_PLLCLKIN               (AT32_HEXTCLK / AT32_PLL_MS_VALUE)
#elif AT32_PLLRCS == AT32_PLLRCS_HICK
#define AT32_PLLCLKIN               ((AT32_HICKCLK / 6) / AT32_PLL_MS_VALUE)
#else
#error "invalid AT32_PLLRCS value specified"
#endif

/* PLL input frequency range check.*/
#if (AT32_PLLCLKIN < AT32_PLLIN_MIN) || (AT32_PLLCLKIN > AT32_PLLIN_MAX)
#error "AT32_PLLCLKIN outside acceptable range (AT32_PLLIN_MIN...AT32_PLLIN_MAX)"
#endif

/**
 * @brief   AT32_PLL_MS field.
 */
#if ((AT32_PLL_MS_VALUE >= 1) && (AT32_PLL_MS_VALUE <= 15)) ||              \
    defined(__DOXYGEN__)
#define AT32_PLL_MS                 (AT32_PLL_MS_VALUE << 0)
#else
#error "invalid AT32_PLL_MS_VALUE value specified"
#endif

/**
 * @brief   AT32_PLL_NS field.
 */
#if ((AT32_PLL_NS_VALUE >= 31) && (AT32_PLL_NS_VALUE <= 500)) ||            \
    defined(__DOXYGEN__)
#define AT32_PLL_NS                 (AT32_PLL_NS_VALUE << 6)
#else
#error "invalid AT32_PLL_NS_VALUE value specified"
#endif

/**
 * @brief   AT32_PLL_FP field.
 */
#if (AT32_PLL_FP_VALUE == 1) || defined(__DOXYGEN__)
#define AT32_PLL_FP                 AT32_PLL_FP_DIV1
#elif AT32_PLL_FP_VALUE == 2
#define AT32_PLL_FP                 AT32_PLL_FP_DIV2
#elif AT32_PLL_FP_VALUE == 4
#define AT32_PLL_FP                 AT32_PLL_FP_DIV4
#elif AT32_PLL_FP_VALUE == 6
#define AT32_PLL_FP                 AT32_PLL_FP_DIV6
#elif AT32_PLL_FP_VALUE == 8
#define AT32_PLL_FP                 AT32_PLL_FP_DIV8
#elif AT32_PLL_FP_VALUE == 10
#define AT32_PLL_FP                 AT32_PLL_FP_DIV10
#elif AT32_PLL_FP_VALUE == 12
#define AT32_PLL_FP                 AT32_PLL_FP_DIV12
#elif AT32_PLL_FP_VALUE == 14
#define AT32_PLL_FP                 AT32_PLL_FP_DIV14
#elif AT32_PLL_FP_VALUE == 16
#define AT32_PLL_FP                 AT32_PLL_FP_DIV16
#elif AT32_PLL_FP_VALUE == 18
#define AT32_PLL_FP                 AT32_PLL_FP_DIV18
#elif AT32_PLL_FP_VALUE == 20
#define AT32_PLL_FP                 AT32_PLL_FP_DIV20
#elif AT32_PLL_FP_VALUE == 22
#define AT32_PLL_FP                 AT32_PLL_FP_DIV22
#elif AT32_PLL_FP_VALUE == 24
#define AT32_PLL_FP                 AT32_PLL_FP_DIV24
#elif AT32_PLL_FP_VALUE == 26
#define AT32_PLL_FP                 AT32_PLL_FP_DIV26
#elif AT32_PLL_FP_VALUE == 28
#define AT32_PLL_FP                 AT32_PLL_FP_DIV28
#elif AT32_PLL_FP_VALUE == 30
#define AT32_PLL_FP                 AT32_PLL_FP_DIV30
#else
#error "invalid AT32_PLL_FP_VALUE value specified"
#endif

/**
 * @brief   AT32_PLL_FU field.
 */
#if (AT32_PLL_FU_VALUE == 11) || defined(__DOXYGEN__)
#define AT32_PLL_FU                 AT32_PLL_FU_DIV11
#elif AT32_PLL_FU_VALUE == 12
#define AT32_PLL_FU                 AT32_PLL_FU_DIV12
#elif AT32_PLL_FU_VALUE == 13
#define AT32_PLL_FU                 AT32_PLL_FU_DIV13
#elif AT32_PLL_FU_VALUE == 14
#define AT32_PLL_FU                 AT32_PLL_FU_DIV14
#elif AT32_PLL_FU_VALUE == 16
#define AT32_PLL_FU                 AT32_PLL_FU_DIV16
#elif AT32_PLL_FU_VALUE == 18
#define AT32_PLL_FU                 AT32_PLL_FU_DIV18
#elif AT32_PLL_FU_VALUE == 20
#define AT32_PLL_FU                 AT32_PLL_FU_DIV20
#else
#error "invalid AT32_PLL_FU_VALUE value specified"
#endif

/**
 * @brief   PLL VCO frequency.
 */
#define AT32_PLLVCO                 (AT32_PLLCLKIN * AT32_PLL_NS_VALUE)

