qmk-arterytek/ChibiOS-Contrib/os/hal/ports/AT32/AT32F405/hal_lld.h
#if (AT32_HCLK > 168000000) ||                                              \
    (AT32_PCLK1 > 120000000) ||                                             \
    (AT32_PCLK2 > AT32_HCLK)
#error "AT32 bus clock exceeding maximum frequency when LDO is 1.2V"
#endif

#elif AT32_LDOOVSEL == AT32_LDOOVSEL_LEV0

#if (AT32_HCLK > 108000000) ||                                              \
    (AT32_PCLK1 > AT32_HCLK) ||                                             \
    (AT32_PCLK2 > AT32_HCLK)
#error "AT32 bus clock exceeding maximum frequency when LDO is 1.0V"
#endif

#else
#error "invalid AT32_LDOOVSEL value specified"
#endif

/**
 * @brief   ERTC clock.
 */
#if (AT32_ERTCSEL == AT32_ERTCSEL_LEXT) || defined(__DOXYGEN__)
#define AT32_ERTCCLK                AT32_LEXTCLK
#elif AT32_ERTCSEL == AT32_ERTCSEL_LICK
#define AT32_ERTCCLK                AT32_LICKCLK
#elif AT32_ERTCSEL == AT32_ERTCSEL_HEXTDIV
#define AT32_ERTCCLK                AT32_HEXTDIVCLK
#elif AT32_ERTCSEL == AT32_ERTCSEL_NOCLOCK
#define AT32_ERTCCLK                0
#else
#error "invalid source selected for ERTC clock"
#endif

/**
 * @brief   HEXT divider toward ERTC clock.
 */
#if ((AT32_ERTCDIV_VALUE >= 2) && (AT32_ERTCDIV_VALUE <= 31)) ||            \
    defined(__DOXYGEN__)
#define AT32_HEXTDIVCLK             (AT32_HEXTCLK / AT32_ERTCDIV_VALUE)
#define AT32_ERTCDIV                (AT32_ERTCDIV_VALUE << 16)
#else
#error "invalid AT32_ERTCDIV value specified"
#endif

/**
 * @brief   I2SF5 clock.
 */
#if (AT32_I2SF5CLKSEL == AT32_I2SF5CLKSEL_SCLK) || defined(__DOXYGEN__)
#define AT32_I2SF5CLK               AT32_SYSCLK
#elif AT32_I2SF5CLKSEL == AT32_I2SF5CLKSEL_PLL
#define AT32_I2SF5CLK               AT32_PLLPCLK
#elif AT32_I2SF5CLKSEL == AT32_I2SF5CLKSEL_HICK
#define AT32_I2SF5CLK               AT32_HICKCLKOUT
#elif AT32_I2SF5CLKSEL == AT32_I2SF5CLKSEL_EXTERNAL
#define AT32_I2SF5CLK               0
#else
#error "invalid AT32_I2SF5CLKSEL value specified"
#endif

/**
 * @brief   USB clock.
 */
#if (AT32_PLLU_USB48_SEL == AT32_PLLU_USB48_SEL_PLLU) || defined(__DOXYGEN__)
#define AT32_USBCLK                 AT32_PLLUCLK
#elif AT32_PLLU_USB48_SEL == AT32_PLLU_USB48_SEL_HICK
#define AT32_USBCLK                 AT32_HICKCLKOUT
#else
#error "invalid AT32_PLLU_USB48_SEL value specified"
#endif

/**
 * @brief   Timers 2, 3, 4, 6, 7, 13, 14 clock.
 */
#if (AT32_APB1DIV == AT32_APB1DIV_DIV1) || defined(__DOXYGEN__)
#define AT32_TMRCLK1                (AT32_PCLK1 * 1)
#else
#define AT32_TMRCLK1                (AT32_PCLK1 * 2)
#endif

/**
 * @brief   Timers 1, 9, 10, 11 clock.
 */
#if (AT32_APB2DIV == AT32_APB2DIV_DIV1) || defined(__DOXYGEN__)
#define AT32_TMRCLK2                (AT32_PCLK2 * 1)
#else
#define AT32_TMRCLK2                (AT32_PCLK2 * 2)
#endif

/**
 * @brief   Flash settings.
 */
#if (AT32_HCLK <= 32000000) || defined(__DOXYGEN__)
#define AT32_FLASHBITS              0x00000150
#elif (AT32_HCLK <= 64000000)
#define AT32_FLASHBITS              0x00000151
#elif (AT32_HCLK <= 96000000)
#define AT32_FLASHBITS              0x00000152
#elif (AT32_HCLK <= 128000000)
#define AT32_FLASHBITS              0x00000153
#elif (AT32_HCLK <= 160000000)
#define AT32_FLASHBITS              0x00000154
#elif (AT32_HCLK <= 192000000)
#define AT32_FLASHBITS              0x00000155
#elif (AT32_HCLK <= 216000000)
#define AT32_FLASHBITS              0x00000156
#endif

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

/* Various helpers.*/
#include "nvic.h"
#include "cache.h"
#include "mpu_v7m.h"
#include "at32_crm.h"
//#include "at32_dma.h"
#include "at32_exint.h"
#include "at32_isr.h"
#include "at32_tmr.h"

#ifdef __cplusplus
extern "C" {
#endif
  void hal_lld_init(void);
  void at32_clock_init(void);
#ifdef __cplusplus
}
#endif

#endif /* _HAL_LLD_H_ */

/** @} */
